[
{"Title": ["General and Surprising"], "Content": ["September 2017", "The most valuable insights are both general and surprising.\nF = ma for example. But general and surprising is a hard\ncombination to achieve. That territory tends to be picked\nclean, precisely because those insights are so valuable.", "Ordinarily, the best that people can do is one without the\nother: either surprising without being general (e.g.\ngossip), or general without being surprising (e.g.\nplatitudes).", "Where things get interesting is the moderately valuable\ninsights.  You get those from small additions of whichever\nquality was missing.  The more common case is a small\naddition of generality: a piece of gossip that's more than\njust gossip, because it teaches something interesting about\nthe world. But another less common approach is to focus on\nthe most general ideas and see if you can find something new\nto say about them. Because these start out so general, you\nonly need a small delta of novelty to produce a useful\ninsight.", "A small delta of novelty is all you'll be able to get most\nof the time. Which means if you take this route your ideas\nwill seem a lot like ones that already exist. Sometimes\nyou'll find you've merely rediscovered an idea that did\nalready exist.  But don't be discouraged.  Remember the huge\nmultiplier that kicks in when you do manage to think of\nsomething even a little new.", "Corollary: the more general the ideas you're talking about,\nthe less you should worry about repeating yourself.  If you\nwrite enough, it's inevitable you will.  Your brain is much\nthe same from year to year and so are the stimuli that hit\nit. I feel slightly bad when I find I've said something\nclose to what I've said before, as if I were plagiarizing\nmyself. But rationally one shouldn't.  You won't say\nsomething exactly the same way the second time, and that\nvariation increases the chance you'll get that tiny but\ncritical delta of novelty.", "And of course, ideas beget ideas.  (That sounds familiar.)\nAn idea with a small amount of novelty could lead to one\nwith more. But only if you keep going. So it's doubly\nimportant not to let yourself be discouraged by people who\nsay there's not much new about something you've discovered.\n\"Not much new\" is a real achievement when you're talking\nabout the most general ideas. Maybe if you keep going,\nyou'll discover more.", "It's not true that there's nothing new under the sun.  There\nare some domains where there's almost nothing new.  But\nthere's a big difference between nothing and almost nothing,\nwhen it's multiplied by the area under the sun.", "\n", " to Sam Altman, Patrick Collison, and Jessica\nLivingston for reading drafts of this."]},
{"Title": ["Five Founders"], "Content": ["April 2009", " recently asked me who I thought were the 5 most\ninteresting startup founders of the last 30 years.  How do\nyou decide who's the most interesting?  The best test seemed\nto be influence: who are the 5\nwho've influenced me most?  Who do I use as examples when I'm\ntalking to companies we fund?  Who do I find myself quoting?", "I'd guess Steve is the most influential founder not just for me but\nfor most people you could ask.  A lot of startup culture is Apple\nculture.  He was the original young founder.  And while the concept\nof \"insanely great\" already existed in the arts, it was a novel\nidea to introduce into a company in the 1980s.", "More remarkable still, he's stayed interesting for 30 years.  People\nawait new Apple products the way they'd await new books by a popular\nnovelist.  Steve may not literally design them, but they wouldn't\nhappen if he weren't CEO.", "Steve is clever and driven, but so are a lot of people in the Valley.\nWhat makes him unique is his \n", ".  Before him, most\ncompanies treated design as a frivolous extra.  Apple's competitors\nnow know better.", "TJ Rodgers isn't as famous as Steve Jobs, but he may be the best\nwriter among Silicon Valley CEOs.  I've probably learned more from\nhim about the startup way of thinking than from anyone else.  Not\nso much from specific things he's written as by reconstructing the\nmind that produced them: brutally candid; aggressively garbage-collecting\noutdated ideas; and yet driven by pragmatism rather than ideology.", "The first essay of his that I read was so electrifying that I\nremember exactly where I was at the time.  It was \n", " and\nI was downstairs in the Harvard Square T Station.  It felt as if\nsomeone had flipped on a light switch inside my head.", "I'm sorry to treat Larry and Sergey as one person.  I've always\nthought that was unfair to them.  But it does seem as if Google was a\ncollaboration.", "Before Google, companies in Silicon Valley already knew it was\nimportant to have the best hackers.  So they claimed, at least.\nBut Google pushed this idea further than anyone had before.  Their\nhypothesis seems to have been that, in the initial stages at least,\n", " you need is good hackers: if you hire all the smartest people\nand put them to work on a problem where their success can be measured,\nyou win.  All the other stuff—which includes all the stuff that\nbusiness schools think business consists of—you can figure out\nalong the way.  The results won't be perfect, but they'll be optimal.\nIf this was their hypothesis, it's now been verified experimentally.", "Few know this, but one person, Paul Buchheit, is responsible for\nthree of the best things Google has done.  He was the original\nauthor of GMail, which is the most impressive thing Google has after\nsearch.  He also wrote the first prototype of AdSense, and was the\nauthor of Google's mantra \"Don't be evil.\"", "PB made a point in a talk once that I now mention to every startup\nwe fund: that it's better, initially, to make a small number of\nusers really love you than a large number kind of like you.   If I\ncould tell startups only \n", ", \nthis would be one of them.", "Now he's cofounder of a startup called Friendfeed.  It's only a\nyear old, but already everyone in the Valley is watching them.\nSomeone responsible for three of the biggest ideas at Google is\ngoing to come up with more.", "I was told I shouldn't mention founders of YC-funded companies in\nthis list.   But Sam Altman can't be stopped by such flimsy rules.\nIf he wants to be on this list, he's going to be.", "Honestly, Sam is, along with Steve Jobs, the founder I refer to\nmost when I'm advising startups.  On questions of design, I ask\n\"What would Steve do?\" but on questions of strategy or ambition I\nask \"What would Sama do?\"", "What I learned from meeting Sama is that the doctrine of the elect\napplies to startups.  It applies way less than most people think:\nstartup investing does not consist of trying to pick winners the\nway you might in a horse race.  But there are a few people with\nsuch force of will that they're going to get whatever they want."]},
{"Title": ["The Founder Visa"], "Content": []},
{"Title": ["Why Twitter is a Big Deal"], "Content": ["April 2009", " is the most recent of many people\nto ask why Twitter is such a big deal.", "The reason is that it's a new messaging \nprotocol, where you don't specify the recipients.\nNew protocols are rare.  Or more precisely, new\nprotocols that take off are.\nThere are only a handful of commonly used ones: TCP/IP \n(the Internet), SMTP (email), HTTP (the web), and so on.  So any\nnew protocol is a big deal.  But Twitter is a protocol owned\nby a private company.  That's even rarer.", "Curiously, the fact that the founders of Twitter \nhave been slow to monetize it may in the long run\nprove to be an advantage.  Because they haven't tried\nto control it too much, Twitter feels to everyone like\nprevious protocols.  One forgets it's owned by a\nprivate company.  That must have made it easier for\nTwitter to spread."]},
{"Title": ["A Local Revolution?"], "Content": ["April 2009", "Recently I realized I'd been holding two ideas in my head that would explode if combined.", "The first is that startups may represent a ", ", on the scale of the Industrial Revolution. I'm not sure of this, but there seems a decent chance it's true.  People are dramatically more \n", "[", "1", "]", "[", "2", "]", "[", "3", "]", "1", "2", "3"]},
{"Title": ["Maker's Schedule, Manager's Schedule "], "Content": ["\n", "  Get funded by\n", ".\n", "\n"]},
{"Title": ["Ramen Profitable"], "Content": ["\n", "  Get funded by\n", ".\n", "\n", "[", "1", "]", "[", "2", "]", "[", "3", "]", "1", "2", "3"]},
{"Title": ["The Trouble with the Segway"], "Content": ["July 2009", "The Segway hasn't delivered on its initial promise, to put it mildly.\nThere are several reasons why, but one is that people don't want\nto be seen riding them. Someone riding a Segway looks like a dork.", "My friend Trevor Blackwell built \n", ", \nwhich we called\nthe Segwell. He also built a one-wheeled version, \n", ",\nwhich looks exactly like a regular unicycle till you realize the\nrider isn't pedaling.  He has ridden them both to downtown Mountain\nView to get coffee.  When he rides the Eunicycle, people smile at\nhim.  But when he rides the Segwell, they shout abuse from their\ncars: \"Too lazy to walk, ya fuckin homo?\"", "Why do Segways provoke this reaction?  The reason you look like a\ndork riding a Segway is that you look ", ".  You don't seem to\nbe working hard enough.", "Someone riding a motorcycle isn't working any harder. But because\nhe's sitting astride it, he seems to be making an effort.  When\nyou're riding a Segway you're just standing there.  And someone who's\nbeing whisked along while seeming to do no work—someone in a sedan\nchair, for example—can't help but look smug.", "Try this thought experiment and it becomes clear: imagine something\nthat worked like the Segway, but that you rode with one foot in\nfront of the other, like a skateboard.  That wouldn't seem nearly\nas uncool.", "So there may be a way to capture more of the market Segway hoped\nto reach: make a version that doesn't look so easy for the rider.\nIt would also be helpful if the styling was in the tradition of\nskateboards or bicycles rather than medical devices.", "Curiously enough, what got Segway into this problem was that the\ncompany was itself a kind of Segway.  It was too easy for them;\nthey were too successful raising money.  If they'd had to grow the\ncompany gradually, by iterating through several versions they sold\nto real users, they'd have learned pretty quickly that people looked\nstupid riding them. Instead they had enough to work in secret.  They\nhad focus groups aplenty, I'm sure, but they didn't have the people\nyelling insults out of cars.  So they never realized they were\nzooming confidently down a blind alley."]},
{"Title": ["What Kate Saw in Silicon Valley  "], "Content": ["August 2009", "Kate Courteau is the architect who designed Y Combinator's office.\nRecently we managed to recruit her to help us run YC when she's not\nbusy with architectural projects.  Though she'd heard a lot about\nYC since the beginning, the last 9 months have been a total immersion.", "I've been around the startup world for so long that it seems normal\nto me, so I was curious to hear what had surprised her most about\nit.  This was her list:", " Kate knew in principle that startups\nwere very risky, but she was surprised to see how constant the\nthreat of failure was—not just for the minnows, but even for the\nfamous startups whose founders came to speak at YC dinners.", "\n", " As usual, by Demo Day about\nhalf the startups were doing something significantly different than\nthey started with.  We encourage that.  Starting a startup is like\nscience in that you have to follow the truth wherever it leads.  In\nthe rest of the world, people don't start things till they're sure\nwhat they want to do, and once started they tend continue on their\ninitial path even if it's mistaken.", "\n", " In Kate's\nworld, everything is still physical and expensive.  You can barely\nrenovate a bathroom for the cost of starting a startup.", "\n", "  That was her actual word.  I agree\nwith her, but till she mentioned this it never occurred to me how\nlittle this quality is appreciated in most of the rest of the world.\nIt wouldn't be a compliment in most organizations to call someone\nscrappy.", "What does it mean, exactly?  It's basically the diminutive form of\nbelligerent.  Someone who's scrappy manages to be both threatening\nand undignified at the same time.   Which seems to me exactly what\none would want to be, in any kind of work.  If you're not threatening,\nyou're probably not doing anything new, and dignity is merely a\nsort of plaque.", "\n", "  \"It seems like everybody\nhere is in the industry.\"  That isn't literally true, but there is\na qualitative difference between Silicon Valley and other places.\nYou tend to keep your voice down, because there's a good chance the\nperson at the next table would know some of the people you're talking\nabout.  I never felt that in Boston.  The good news is, there's\nalso a good chance the person at the next table could help you in\nsome way.", "\n", "\nActually, I've noticed this too.  I always worry the speakers will\nput us in an embarrassing position by contradicting what we tell the\nstartups, but it happens surprisingly rarely.", "When I asked her what specific things she remembered speakers always\nsaying, she mentioned: that the way to succeed was to launch something\nfast, listen to users, and then iterate; that startups required\nresilience because they were always an emotional rollercoaster; and\nthat most VCs were sheep.", "I've been impressed by how consistently the speakers advocate\nlaunching fast and iterating.  That was contrarian advice 10 years\nago, but it's clearly now the established practice.", "\n", "  Most of the famous\nfounders in Silicon Valley are people you'd overlook on the street.\nIt's not merely that they don't dress up.  They don't project any\nkind of aura of power either.  \"They're not trying to impress\nanyone.\"", "Interestingly, while Kate said that she could never pick out\nsuccessful founders, she could recognize VCs, both by the way they\ndressed and the way they carried themselves.", "\n", "\n(I swear I didn't prompt this one.)  Without advice \"they'd just\nbe sort of lost.\"  Fortunately, there are a lot of people to help\nthem.  There's a strong tradition within YC of helping other YC-funded\nstartups.  But we didn't invent that idea: it's just a slightly\nmore concentrated form of existing Valley culture.", "\n", "  Architects are constantly\ninteracting face to face with other people, whereas doing a technology\nstartup, at least, tends to require long stretches of uninterrupted\ntime to work.  \"You could do it in a box.\"", "By inverting this list, we can get a portrait of the \"normal\" world.\nIt's populated by people who talk a lot with one another as they\nwork slowly but harmoniously on conservative, expensive projects\nwhose destinations are decided in advance, and who carefully adjust\ntheir manner to reflect their position in the hierarchy.", "That's also a fairly accurate description of the past.  So startup\nculture may not merely be different in the way you'd expect any\nsubculture to be, but a leading indicator."]},
{"Title": ["The Anatomy of Determination "], "Content": ["\n", "  Get funded by\n", ".\n", "\n", "[", "1", "]", "[", "2", "]", "[", "3", "]", "1", "2", "3"]},
{"Title": ["The List of N Things"], "Content": ["September 2009", "I bet you the current issue of ", " has an article\nwhose title begins with a number. \"7 Things He Won't Tell You about\nSex,\" or something like that.  Some popular magazines\nfeature articles of this type on the cover of every\nissue.  That can't be happening by accident.  Editors must know\nthey attract readers.", "Why do readers like the list of n things so much?   Mainly because\nit's easier to read than a regular article.  \n", "[", "1", "]", "\nStructurally, the list of n things is a degenerate case of essay.\nAn essay can go anywhere the writer wants.  In a list of n things\nthe writer agrees to constrain himself to a collection of points\nof roughly equal importance, and he tells the reader explicitly\nwhat they are.", "Some of the work of reading an article is understanding its\nstructure—figuring out what in high school we'd have called\nits \"outline.\" Not explicitly, of course, but someone who really\nunderstands an article probably has something in his brain afterward\nthat corresponds to such an outline.  In a list of n things, this\nwork is done for you.  Its structure is an exoskeleton.", "As well as being explicit, the structure is guaranteed to be of the\nsimplest possible type: a few main points with few to no subordinate\nones, and no particular connection between them.", "Because the main points are unconnected, the list of n things is\nrandom access.  There's no thread of reasoning you have to follow.  You could\nread the list in any order.  And because the points are independent\nof one another, they work like watertight compartments in an\nunsinkable ship.  If you get bored with, or can't understand, or\ndon't agree with one point, you don't have to give up on the article.\nYou can just abandon that one and skip to the next.  A list of n\nthings is parallel and therefore fault tolerant.", "There are times when this format is what a writer wants.  One, obviously,\nis when what you have to say actually is a list of n\nthings.  I once wrote an essay about the ", ", and a few people made fun of me\nfor writing something whose title began with a number.  But in that\ncase I really was trying to make a complete catalog of a number of\nindependent things.  In fact, one of the questions I was trying to\nanswer was how many there were.", "There are other less legitimate reasons for using this format.  For\nexample, I use it when I get close to a deadline.  If I have to\ngive a talk and I haven't started it a few days beforehand, I'll\nsometimes play it safe and make the talk a list of n things.", "The list of n things is easier for writers as well as readers.  When\nyou're writing a real essay, there's always a chance you'll hit a\ndead end.  A real essay is a train of thought, and some trains of\nthought just peter out.  That's an alarming possibility when you\nhave to give a talk in a few days.  What if you run out of ideas?\nThe compartmentalized structure of the list of n things protects\nthe writer from his own stupidity in much the same way it protects\nthe reader.  If you run out of ideas on one point, no problem: it\nwon't kill the essay.  You can take out the whole point if you need\nto, and the essay will still survive.", "Writing a list of n things is so relaxing.  You think of n/2 of\nthem in the first 5 minutes.  So bang, there's the structure, and\nyou just have to fill it in.  As you think of more points, you just\nadd them to the end.  Maybe you take out or rearrange or combine a\nfew, but at every stage you have a valid (though initially low-res)\nlist of n things.  It's like the sort of programming where you write\na version 1 very quickly and then gradually modify it, but at every\npoint have working code—or the style of painting where you begin\nwith a complete but very blurry sketch done in an hour, then spend\na week cranking up the resolution.", "Because the list of n things is easier for writers too, it's not\nalways a damning sign when readers prefer it.  It's not necessarily\nevidence readers are lazy; it could also mean they don't have\nmuch confidence in the writer.  The list of n things is in that\nrespect the cheeseburger of essay forms.  If you're eating at a\nrestaurant you suspect is bad, your best bet is to order the\ncheeseburger.  Even a bad cook can make a decent cheeseburger.  And\nthere are pretty strict conventions about what a cheeseburger should\nlook like.  You can assume the cook isn't going to try something\nweird and artistic.  The list of n things similarly limits the\ndamage that can be done by a bad writer.  You know it's going to\nbe about whatever the title says, and the format prevents the writer\nfrom indulging in any flights of fancy.", "Because the list of n things is the easiest essay form, it should\nbe a good one for beginning writers.  And in fact it is what most\nbeginning writers are taught.  The classic 5 paragraph essay is\nreally a list of n things for n = 3.  But the students writing them\ndon't realize they're using the same structure as the articles they\nread in ", ". They're not allowed to include the numbers,\nand they're expected to spackle over the gaps with gratuitous\ntransitions (\"Furthermore...\") and cap the thing at either end with\nintroductory and concluding paragraphs so it will look superficially\nlike a real essay.\n", "[", "2", "]", "It seems a fine plan to start students off with the list of n things.\nIt's the easiest form.  But if we're going to do that, why not do\nit openly?  Let them write lists of n things like the pros, with\nnumbers and no transitions or \"conclusion.\"", "There is one case where the list of n things is a dishonest format:\nwhen you use it to attract attention by falsely claiming the list\nis an exhaustive one.  I.e. if you write an article that purports\nto be about ", " 7 secrets of success.  That kind of title is the\nsame sort of reflexive challenge as a whodunit. You have to at least\nlook at the article to check whether they're the same 7 you'd list.\nAre you overlooking one of the secrets of success?  Better check.", "It's fine to put \"The\" before the number if you really believe\nyou've made an exhaustive list.  But evidence suggests most things\nwith titles like this are linkbait.", "The greatest weakness of the list of n things is that there's so\nlittle room for new thought.  The main point of essay writing, when\ndone right, is the new ideas you have while doing it.  A real essay,\nas the name implies, is \n", ": you don't know what you're going\nto write when you start.  It will be about whatever you discover\nin the course of writing it.", "This can only happen in a very limited way in a list of n things.\nYou make the title first, and that's what it's going to be about.\nYou can't have more new ideas in the writing than will fit in the\nwatertight compartments you set up initially.  And your brain seems\nto know this: because you don't have room for new ideas, you don't\nhave them.", "Another advantage of admitting to beginning writers that the 5\nparagraph essay is really a list of n things is that we can warn\nthem about this.  It only lets you experience the defining\ncharacteristic of essay writing on a small scale: in thoughts of a\nsentence or two.  And it's particularly dangerous that the 5 paragraph\nessay buries the list of n things within something that looks like\na more sophisticated type of essay.  If you don't know you're using\nthis form, you don't know you need to escape it.", "[", "1", "]\nArticles of this type are also startlingly popular on Delicious,\nbut I think that's because \n", " \nis driven by bookmarking,\nnot because Delicious users are stupid.  Delicious users are\ncollectors, and a list of n things seems particularly collectible\nbecause it's a collection itself.", "[", "2", "]\nMost \"word problems\" in school math textbooks are similarly\nmisleading.  They look superficially like the application of math\nto real problems, but they're not.  So if anything they reinforce\nthe impression that math is merely a complicated but pointless\ncollection of stuff to be memorized."]},
{"Title": ["Post-Medium Publishing"], "Content": ["September 2009", "Publishers of all types, from news to music, are unhappy that\nconsumers won't pay for content anymore.  At least, that's how they\nsee it.", "In fact consumers never really were paying for content, and publishers\nweren't really selling it either.  If the content was what they\nwere selling, why has the price of books or music or movies always\ndepended mostly on the format?  Why didn't better content cost more?\n", "[", "1", "]", "A copy of ", " costs $5 for 58 pages, or 8.6 cents a page.  \n", " costs $7 for 86 pages, or 8.1 cents a page.  Better\njournalism is actually slightly cheaper.", "Almost every form of publishing has been organized as if the medium\nwas what they were selling, and the content was irrelevant.  Book\npublishers, for example, set prices based on the cost of producing\nand distributing books.  They treat the words printed in the book\nthe same way a textile manufacturer treats the patterns printed on\nits fabrics.", "Economically, the print media are in the business of marking up\npaper.  We can all imagine an old-style editor getting a scoop and\nsaying \"this will sell a lot of papers!\" Cross out that final S and\nyou're describing their business model.  The reason they make less\nmoney now is that people don't need as much paper.", "A few months ago I ran into a friend in a cafe.  I had a copy of\nthe ", ", which I still occasionally buy on weekends.  As\nI was leaving I offered it to him, as I've done countless times\nbefore in the same situation.  But this time something new happened.\nI felt that sheepish feeling you get when you offer someone something\nworthless.  \"Do you, er, want a printout of yesterday's news?\" I\nasked.  (He didn't.)", "Now that the medium is evaporating, publishers have nothing left\nto sell.  Some seem to think they're going to sell content—that\nthey were always in the content business, really.  But they weren't,\nand it's unclear whether anyone could be.", "There have always been people in the business of selling information,\nbut that has historically been a distinct business from publishing.\nAnd the business of selling information to consumers has always\nbeen a marginal one.  When I was a kid there were people who used\nto sell newsletters containing stock tips, printed on colored paper\nthat made them hard for the copiers of the day to reproduce.  That\nis a different world, both culturally and economically, from the\none publishers currently inhabit.", "People will pay for information they think they can make money from.\nThat's why they paid for those stock tip newsletters, and why\ncompanies pay now for Bloomberg terminals and Economist Intelligence\nUnit reports.  But will people pay for information otherwise?\nHistory offers little encouragement.", "If audiences were willing to pay more for better content, why wasn't\nanyone already selling it to them?  There was no reason you couldn't\nhave done that in the era of physical media.  So were the print\nmedia and the music labels simply overlooking this opportunity?  Or\nis it, rather, nonexistent?", "What about iTunes?  Doesn't that show people will pay for content?\nWell, not really. iTunes is more of a tollbooth than a store.  Apple\ncontrols the default path onto the iPod.  They offer a convenient\nlist of songs, and whenever you choose one they ding your credit\ncard for a small amount, just below the threshold of attention.\nBasically, iTunes makes money by taxing people, not selling them\nstuff.  You can only do that if you own the channel, and even then\nyou don't make much from it, because a toll has to be ignorable to\nwork.  Once a toll becomes painful, people start to find ways around\nit, and that's pretty easy with digital content.", "The situation is much the same with digital books.  Whoever controls\nthe device sets the terms.  It's in their interest for content to\nbe as cheap as possible, and since they own the channel, there's a\nlot they can do to drive prices down.  Prices will fall even further\nonce writers realize they don't need publishers.  Getting a book\nprinted and distributed is a daunting prospect for a writer, but\nmost can upload a file.", "Is software a counterexample?  People pay a lot for desktop software,\nand that's just information.  True, but I don't think publishers\ncan learn much from software.  Software companies can charge a lot\nbecause (a) many of the customers are businesses, who get in \n", "\nif they use pirated versions, and (b) though in form merely\ninformation, software is treated by both maker and purchaser as a\ndifferent type of thing from a song or an article.   A Photoshop\nuser needs Photoshop in a way that no one needs a particular song\nor article.", "That's why there's a separate word, \"content,\" for information\nthat's not software.  Software is a different business.  Software\nand content blur together in some of the most lightweight software,\nlike casual games.  But those are usually free.   To make money the\nway software companies do, publishers would have to become software\ncompanies, and being publishers gives them no particular head start\nin that domain. \n", "[", "2", "]", "The most promising countertrend is the premium cable channel.  People\nstill pay for those.  But broadcasting isn't publishing: you're not\nselling a copy of something.  That's one reason the movie business\nhasn't seen their revenues decline the way the news and music\nbusinesses have.  They only have one foot in publishing.", "To the extent the movie business can avoid becoming publishers,\nthey may avoid publishing's problems.  But there are limits to how\nwell they'll be able to do that.  Once publishing—giving people\ncopies—becomes the most natural way of distributing your content,\nit probably doesn't work to stick to old forms of distribution just\nbecause you make more that way.  If free copies of your content are\navailable online, then you're competing with publishing's form of\ndistribution, and that's just as bad as being a publisher.", "Apparently some people in the music business hope to retroactively\nconvert it away from publishing, by getting listeners to pay for\nsubscriptions.  It seems unlikely that will work if they're just\nstreaming the same files you can get as mp3s.", "What happens to publishing if you can't sell content?  You have two\nchoices: give it away and make money from it indirectly, or find\nways to embody it in things people will pay for.", "The first is probably the future of most current media.  \n", " and make money from concerts and t-shirts.  Publish articles\nfor free and make money from one of a dozen permutations of\nadvertising.  Both publishers and investors are down on advertising\nat the moment, but it has more potential than they realize.", "I'm not claiming that potential will be realized by the existing\nplayers.  The ", "\nways to make money from the written word\nprobably require different words written by different people.", "It's harder to say what will happen to movies.  They could evolve\ninto ads.  Or they could return to their roots and make going to\nthe theater a treat.  If they made the experience good enough,\naudiences might start to prefer it to watching pirated movies at\nhome. \n", "[", "3", "]", "\nOr maybe the movie business will dry up, and the people\nworking in it will go to work for game developers.", "I don't know how big embodying information in physical form will\nbe.  It may be surprisingly large; people overvalue \n", ".\nThere should remain some market for printed books, at least.", "I can see the evolution of book publishing in the books on my\nshelves.  Clearly at some point in the 1960s the big publishing\nhouses started to ask: how cheaply can we make books before people\nrefuse to buy them?  The answer turned out to be one step short of\nphonebooks.  As long as it isn't floppy, consumers still perceive\nit as a book.", "That worked as long as buying printed books was the only way to\nread them.  If printed books are optional, publishers will have to\nwork harder to entice people to buy them.  There should be some\nmarket, but it's hard to foresee how big, because its size will\ndepend not on macro trends like the amount people read, but on the\ningenuity of individual publishers. \n", "[", "4", "]", "Some magazines may thrive by focusing on the magazine as a physical\nobject.  Fashion magazines could be made lush in a way that would\nbe hard to match digitally, at least for a while.  But this is\nprobably not an option for most magazines.", "I don't know exactly what the future will look like, but I'm not\ntoo worried about it.  This sort of change tends to create as many\ngood things as it kills.  Indeed, the really interesting question is not\nwhat will happen to existing forms, but what new forms will appear.", "The reason I've been writing about existing forms is that I don't\n", " what new forms will appear.  But though I can't predict\nspecific winners, I can offer a recipe for recognizing them.  When\nyou see something that's taking advantage of new technology to give\npeople something they want that they couldn't have before, you're\nprobably looking at a winner.  And when you see something that's\nmerely reacting to new technology in an attempt to preserve some\nexisting source of revenue, you're probably looking at a loser.", "\n", "[", "1", "]\nI don't like the word \"content\" and tried for a while to avoid\nusing it, but I have to admit there's no other word that means the\nright thing.  \"Information\" is too general.", "Ironically, the main reason I don't like \"content\" is the thesis\nof this essay.  The word suggests an undifferentiated slurry, but\neconomically that's how both publishers and audiences treat it.\nContent is information you don't need.", "[", "2", "]\nSome types of publishers would be at a disadvantage trying\nto enter the software business.  Record labels, for example, would\nprobably find it more natural to expand into casinos than software,\nbecause the kind of people who run them would be more at home at\nthe mafia end of the business spectrum than the don't-be-evil end.", "[", "3", "]\nI never watch movies in theaters anymore.  The tipping point\nfor me was the ads they show first.", "[", "4", "]\nUnfortunately, making physically nice books will only be a\nniche within a niche.  Publishers are more likely to resort to\nexpedients like selling autographed copies, or editions with the\nbuyer's picture on the cover.", " to Michael Arrington, Trevor Blackwell, Steven Levy, Robert\nMorris, and Geoff Ralston for reading drafts of this."]},
{"Title": ["Persuade xor Discover "], "Content": ["September 2009", "When meeting people you don't know very well, the convention is\nto seem extra friendly.  You smile and say \"pleased to meet you,\"\nwhether you are or not.  There's nothing dishonest about this.\nEveryone knows that these little social lies aren't meant\nto be taken literally, just as everyone knows that \n\"Can you pass the salt?\" is only grammatically a question.", "I'm perfectly willing to smile and say \"pleased to meet you\"\nwhen meeting new people.  But there is another set of \ncustoms for being ingratiating in print that are not so\nharmless.", "The reason there's a convention of being ingratiating in print\nis that most essays are written to persuade.\nAnd as any politician could tell\nyou, the way to persuade people is not just to baldly state the\nfacts.  You have to add a spoonful of sugar to make the medicine\ngo down.", "For example, a politician announcing the cancellation of \na government program will not merely say \"The\nprogram is canceled.\" That would seem offensively\ncurt.  Instead he'll spend most of his time talking about the\nnoble effort made by the people who worked on it.", "The reason these conventions are more dangerous is that they\ninteract with the ideas.  Saying \"pleased to meet you\" is just\nsomething you prepend to a conversation, but the sort of spin \nadded by politicians is woven through it.  We're starting to\nmove from social lies to real lies.", "Here's an example of a paragraph from an essay I wrote about\n", ".  As written,\nit tends to offend people who like unions.\n", "\nNow here's the same paragraph rewritten to please instead of\noffending them:\n", "[", "1", "]", "\nIt makes the same point: that it can't have been the personal\nqualities of early union organizers that made unions successful,\nbut must have been some external factor, or otherwise present-day\nunion leaders would have to be inferior people.  But written this\nway it seems like a defense of present-day union organizers rather\nthan an attack on early ones.  That makes it more persuasive to\npeople who like unions, because it seems sympathetic to their cause.", "I believe everything I wrote in the second version.  Early union\nleaders did make heroic sacrifices.   And\npresent union leaders probably would rise to the occasion if\nnecessary.  People tend to; I'm skeptical about the idea of \"the\ngreatest generation.\" \n", "[", "2", "]", "If I believe everything I said in the second version, why didn't I\nwrite it that way?  Why offend people needlessly?", "Because I'd rather offend people than pander to them, \nand if you write about controversial topics you have to choose one or the other.  The degree of\ncourage of past or present union leaders is beside the point; all\nthat matters for the argument is that they're the same.\nBut if you want to please\npeople who are mistaken, you can't simply tell the truth.  You're\nalways going to have to add some sort of padding to protect their\nmisconceptions from bumping against reality.", "Most writers do.  Most writers write to persuade, if only out of\nhabit or politeness.  But I don't write to persuade; I write to\nfigure out.  I write to persuade a hypothetical perfectly unbiased\nreader.", "Since the custom is to write to persuade the actual reader, someone\nwho doesn't will seem arrogant.  In fact, worse than arrogant: since\nreaders are used to essays that try to please someone, an essay\nthat displeases one side in a dispute reads as an attempt to pander\nto the other.  To a lot of pro-union readers, the first paragraph\nsounds like the sort of thing a right-wing radio talk show host\nwould say to stir up his followers.  But it's not.  Something that\ncurtly contradicts one's beliefs can be hard to distinguish from a\npartisan attack on them, but though they can end up in the same\nplace they come from different sources.", "Would it be so bad to add a few extra words, to make people feel\nbetter?  Maybe not.  Maybe I'm excessively attached to conciseness.\nI write ", " the same way I write essays, \nmaking pass after pass\nlooking for anything I can cut.  But I have a legitimate reason for\ndoing this.  You don't know what the ideas are until you get them\ndown to the fewest words.  \n", "[", "3", "]", "The danger of the second paragraph\nis not merely that it's longer.  It's that you start to lie to\nyourself.  The ideas start to get mixed together with the spin\nyou've added to get them past the readers' misconceptions.", "I think the goal of an essay should be to discover \n", " things.  That's my goal, at least.\nAnd most surprising means most different from what people currently\nbelieve.  So writing to persuade and writing to discover are\ndiametrically opposed.  The more your conclusions disagree with\nreaders' present beliefs, the more effort you'll have to expend on\nselling your ideas rather than having them.  As you accelerate,\nthis drag increases, till eventually you reach a point where 100%\nof your energy is devoted to overcoming it and you can't go any\nfaster.", "It's hard enough to overcome one's own misconceptions without having\nto think about how to get the resulting ideas past other people's.\nI worry that if I wrote to persuade, I'd start to shy away unconsciously\nfrom ideas I knew would be hard to sell.  When I notice something\nsurprising, it's usually very faint at first.  There's nothing more\nthan a slight stirring of discomfort.  I don't want anything to get\nin the way of noticing it consciously.", "\n", "[", "1", "]\nI had a strange feeling of being back in high school writing\nthis.  To get a good grade you had to both write the sort of pious\ncrap you were expected to, but also seem to be writing with conviction.\nThe solution was a kind of method acting.  It was revoltingly\nfamiliar to slip back into it.", "[", "2", "]\nExercise for the reader:\nrephrase that thought to please the same people the first version\nwould offend.", "[", "3", "]\nCome to think of it, there is one way in which I deliberately\npander to readers, because it doesn't change the number of words:\nI switch person.  This flattering distinction seems so natural to\nthe average reader that they probably don't notice even when I\nswitch in mid-sentence, though you tend to notice when it's done\nas conspicuously as this.", " to Jessica Livingston and Robert Morris\nfor reading drafts of this.", " An earlier version of this essay began by talking\nabout why people dislike Michael Arrington.  I now believe that\nwas mistaken, and that most people don't dislike him for the\nsame reason I did when I first met him, but simply because\nhe writes about controversial things."]},
{"Title": ["What Startups Are Really Like"], "Content": ["\n", "  Get funded by\n", ".\n", "\n", "\nThe bad news is that I got over 100 other responses listing the\nsurprises they encountered.", "There were very clear patterns in the responses; it was remarkable\nhow often several people had been surprised by exactly the same\nthing.  These were the biggest:", "\n", "This was the surprise mentioned by the most founders.  There were\ntwo types of responses: that you have to be careful who you pick\nas a cofounder, and that you have to work hard to maintain your\nrelationship.", "What people wished they'd paid more attention to when choosing\ncofounders was character and commitment, not ability.  This was\nparticularly true with startups that failed.  The lesson: don't\npick cofounders who will flake.", "Here's a typical reponse:\n", "\nThe reason character is so important is that it's tested more\nseverely than in most other situations.  One founder said explicitly\nthat the relationship between founders was more important than\nability:\n", "\nWe learned this lesson a long time ago.  If you look at the YC\napplication, there are more questions about the commitment and\nrelationship of the founders than their ability.", "Founders of successful startups talked less about choosing cofounders\nand more about how hard they worked to maintain their relationship.\n", "\nSeveral people used that word \"married.\"  It's a far more intense\nrelationship than you usually see between coworkers—partly because\nthe stresses are so much greater, and partly because at first the\nfounders are the whole company.  So this relationship has to be\nbuilt of top quality materials and carefully maintained.  It's the\nbasis of everything.", "\n", "Just as the relationship between cofounders is more intense than\nit usually is between coworkers, so is the relationship between the\nfounders and the company.  Running a startup is not like having a\njob or being a student, because it never stops.  This is so foreign\nto most people's experience that they don't get it till it happens.\n", "[", "1", "]", "\n", "\nIt's exacerbated by the fast pace of startups, which makes it seem\nlike time slows down:\n", "\nIn the best case, total immersion can be exciting:\n", "\nThough I have to say, that quote is from someone we funded this\nsummer.  In a couple years he may not sound so chipper.", "\n", "This was another one lots of people were surprised about.  The ups\nand downs were more extreme than they were prepared for.", "In a startup, things seem great one moment and hopeless the next.\nAnd by next, I mean a couple hours later.\n", "\nThe hard part, obviously, is the lows.  For a lot of founders that\nwas the big surprise:\n", "\nAfter a while, if you don't have significant success to cheer you\nup, it wears you out:\n", "\nThere's a limit to how much you can take.  If you get to the point\nwhere you can't keep working anymore, it's not the end of the world.\nPlenty of famous founders have had some failures along the way.", "\n", "The good news is, the highs are also very high.  Several founders\nsaid what surprised them most about doing a startup was how fun it\nwas:\n", "\nWhat they like most is the freedom:\n", "\nFrankly, though, if I've misled people here, I'm not eager to fix\nthat.  I'd rather have everyone think starting a startup is grim\nand hard than have founders go into it expecting it to be fun, and\na few months later saying \"This is supposed to be ", "? Are you\nkidding?\"", "The truth is, it wouldn't be fun for most people.  A lot of what\nwe try to do in the application process is to weed out the people\nwho wouldn't like it, both for our sake and theirs.", "The best way to put it might be that starting a startup is fun the\nway a survivalist training course would be fun, if you're into that\nsort of thing.  Which is to say, not at all, if you're not.", "\n", "A lot of founders were surprised how important persistence was in\nstartups. It was both a negative and a positive surprise: they were\nsurprised both by the degree of persistence required\n", "\nand also by the degree to which persistence alone was able to\ndissolve obstacles:\n", "\nSeveral founders mentioned specifically how much more important\npersistence was than intelligence.\n", "\nThis applies not just to intelligence but to ability in general,\nand that's why so many people said character was more important in\nchoosing cofounders.", "\n", "You need persistence because everything takes longer than you expect.\nA lot of people were surprised by that.\n", "\nOne reason founders are surprised is that because they work fast,\nthey expect everyone else to.   There's a shocking amount of shear\nstress at every point where a startup touches a more bureaucratic\norganization, like a big company or a VC fund.  That's why fundraising\nand the enterprise market kill and maim so many startups.  \n", "[", "2", "]", "But I think the reason most founders are surprised by how long it\ntakes is that they're overconfident.  They think they're going to\nbe an instant success, like YouTube or Facebook.  You tell them\nonly 1 out of 100 successful startups has a trajectory like that,\nand they all think \"we're going to be that 1.\"", "Maybe they'll listen to one of the more successful founders:\n", "\nThere is a positive side to thinking longer-term.  It's not just\nthat you have to resign yourself to everything taking longer than\nit should.  If you work patiently it's less stressful, and you can\ndo better work:\n", "\nThat's why things get so much better when you hit ramen profitability.\nYou can shift into a different mode of working.", "We often emphasize how rarely startups win simply because they hit\non some magic idea.  I think founders have now gotten that into\ntheir heads.  But a lot were surprised to find this also applies\nwithin startups.  You have to do lots of different things:\n", "\nMost hacker-founders would like to spend all their time programming.\nYou won't get to, unless you fail.  Which can be transformed into:\nIf you spend all your time programming, you will fail.", "The principle extends even into programming.  There is rarely a\nsingle brilliant hack that ensures success:\n", "\nEven in the rare cases where a clever hack makes your fortune, you\nprobably won't know till later:\n", "\nSo the best strategy is to try lots of different things.  The reason\nnot to put all your eggs in one basket is not the usual one,\nwhich applies even when you know which basket is best.  In a startup\nyou don't even know that.", "\n", "Lots of founders mentioned how important it was to launch with the\nsimplest possible thing.  By this point everyone knows you should\nrelease fast and iterate.  It's practically a mantra at YC.  But\neven so a lot of people seem to have been burned by not doing it:\n", "\nWhy do people take too long on the first version?  Pride, mostly.\nThey hate to release something that could be better.  They worry\nwhat people will say about them.  But you have to overcome this:\n", "\nDon't worry what people will say.  If your first version is so\nimpressive that trolls don't make fun of it, you waited too long\nto launch.  \n", "[", "3", "]", "One founder said this should be your approach to all programming,\nnot just startups, and I tend to agree.\n", "\nOver-engineering is poison.  It's not like doing extra work for\nextra credit.  It's more like telling a lie that you then have to\nremember so you don't contradict it.", "\n", "Product development is a conversation with the user that doesn't\nreally start till you launch.  Before you launch, you're like a\npolice artist before he's shown the first version of his sketch to\nthe witness.", "It's so important to launch fast that it may be better to think of\nyour initial version not as a product, but as a trick for getting\nusers to start talking to you.\n", "\nOnce you start talking to users, I guarantee you'll be surprised\nby what they tell you.\n", "\nThe surprise is generally positive as well as negative. They won't\nlike what you've built, but there will be other things they would\nlike that would be trivially easy to implement.  It's not till you\nstart the conversation by launching the wrong thing that they can\nexpress (or perhaps even realize) what they're looking for.", "\n", "To benefit from engaging with users you have to be willing to change\nyour idea.  We've always encouraged founders to see a startup idea\nas a hypothesis rather than a blueprint.  And yet they're still\nsurprised how well it works to change the idea.\n", "\nWhereas mere determination, without flexibility, is a greedy algorithm\nthat may get you nothing more than a mediocre local maximum:\n", "\nYou want to push forward, but at the same time twist and turn to\nfind the most promising path.  One founder put it very succinctly:\n", "\nOne reason this advice is so hard to follow is that people don't\nrealize how hard it is to judge startup ideas, particularly their\nown.  Experienced founders learn to keep an open mind:\n", "\nYou can never tell what will work.  You just have to do whatever\nseems best at each point.  We do this with YC itself.  We still\ndon't know if it will work, but it seems like a decent hypothesis.", "\n", "When you think you've got a great idea, it's sort of like having a\nguilty conscience about something.  All someone has to do is look\nat you funny, and you think \"Oh my God, ", "\"", "These alarms are almost always false:\n", "\nOne reason people overreact to competitors is that they overvalue\nideas.  If ideas really were the key, a competitor with the same\nidea would be a real threat.  But it's usually execution that\nmatters:\n", "\nThis is generally true even if competitors get lots of attention.\n", "\nHype doesn't make satisfied users, at least not for something as\ncomplicated as technology.", "A lot of founders complained about how hard it was to get users,\nthough.\n", "\nThis is a complicated topic.  When you can't get users, it's hard\nto say whether the problem is lack of exposure, or whether the\nproduct's simply bad.  Even good products can be blocked by switching\nor integration costs:\n", "[", "4", "]", "\nThe sharpest criticism of YC came from a founder who said we didn't\nfocus enough on customer acquisition:\n", "\nThis may be true; this may be something we need to fix, especially\nfor applications like games.  If you make something where the\nchallenges are mostly technical, you can rely on word of mouth,\nlike Google did.  One founder was surprised by how well that worked\nfor him:\n", "\nBut with other types of startups you may win less by features and\nmore by deals and marketing.", "\n", "Deals fall through.  That's a constant of the startup world.  Startups\nare powerless, and good startup ideas generally seem wrong.  So\neveryone is nervous about closing deals with you, and you have no\nway to make them.", "This is particularly true with investors:\n", "\nMy advice is generally pessimistic.  Assume you won't get money,\nand if someone does offer you any, assume you'll never get any more.\n", "\nWhy do founders ignore me?  Mostly because they're optimistic by\nnature.  The mistake is to be optimistic about things you can't\ncontrol. By all means be optimistic about your ability to make\nsomething great.  But you're asking for trouble if you're optimistic\nabout big companies or investors.", "\n", "A lot of founders mentioned how surprised they were by the cluelessness\nof investors:\n", "\nAngels are a bit better than VCs, because they usually have startup\nexperience themselves:\n", "\nWhy are founders surprised that VCs are clueless?  I think it's\nbecause they seem so formidable.", "The reason VCs seem formidable is that it's their profession to.\nYou get to be a VC by convincing asset managers to trust you with\nhundreds of millions of dollars.  How do you do that?  You have to\nseem confident, and you have to seem like you understand technology.\n", "[", "5", "]", "\n", "Because investors are so bad at judging you, you have to work harder\nthan you should at selling yourself. One founder said the thing\nthat surprised him most was\n", "\nThis is the thing that has surprised ", " most about YC founders'\nexperiences.  This summer we invited some of the alumni to talk to\nthe new startups about fundraising, and pretty much 100% of their\nadvice was about investor psychology.  I thought I was cynical about\nVCs, but the founders were much more cynical.\n", "\nVCs themselves have no idea of the extent to which the startups\nthey like are the ones that are best at selling themselves to VCs.\n", "[", "6", "]", "\nIt's exactly the same phenomenon we saw a step earlier.  VCs get\nmoney by seeming confident to LPs, and founders get money by seeming\nconfident to VCs.", "\n", "With two such random linkages in the path between startups and\nmoney, it shouldn't be surprising that luck is a big factor in\ndeals.  And yet a lot of founders are surprised by it.\n", "\nIf you think about famous startups, it's pretty clear how big a\nrole luck plays.  Where would Microsoft be if IBM insisted on an\nexclusive license for DOS?", "Why are founders fooled by this?  Business guys probably aren't,\nbut hackers are used to a world where skill is paramount, and you\nget what you deserve.\n", "\nActually the best model would be to say that the outcome is the\n", " of skill, determination, and luck.  No matter how much\nskill and determination you have, if you roll a zero for luck, the\noutcome is zero.", "These quotes about luck are not from founders whose startups failed.\nFounders who fail quickly tend to blame themselves.  Founders who\nsucceed quickly don't usually realize how lucky they were.  It's\nthe ones in the middle who see how important luck is.", "\n", "A surprising number of founders said what surprised them most about\nstarting a startup was the value of community.  Some meant the\nmicro-community of YC founders:\n", "\nwhich shouldn't be that surprising, because that's why it's structured\nthat way.  Others were surprised at the value of the startup community\nin the larger sense:\n", "\nThe specific thing that surprised them most was the general spirit\nof benevolence:\n", "\nand particularly how it extended all the way to the top:\n", "\nThis is one of the reasons I like being part of this world.  Creating\nwealth is not a zero-sum game, so you don't have to stab people in\nthe back to win.", "\n", "There was one surprise founders mentioned that I'd forgotten about:\nthat outside the startup world, startup founders get no respect.\n", "\nPartly this is because the rest of the world just doesn't get\nstartups, and partly it's yet another consequence of the fact that\nmost good startup ideas seem bad:\n", "\nUnfortunately this extends even to dating:\n", "\nI did know about that, but I'd forgotten.", "\n", "The last big surprise founders mentioned is how much things changed\nas they grew.  The biggest change was that you got to program even\nless:\n", "\nIn particular, you now have to deal with employees, who often have\ndifferent motivations:\n", "\nFortunately, it can become a lot less stressful once you reach\ncruising altitude:\n", "\nI wish I could say it was this way for every startup that succeeded,\nbut 75% is probably on the high side.", "\n", "There were a few other patterns, but these were the biggest.  One's\nfirst thought when looking at them all is to ask if there's a\nsuper-pattern, a pattern to the patterns.", "I saw it immediately, and so did a YC founder I read the list to.\nThese are supposed to be the surprises, the things I didn't tell\npeople.  What do they all have in common?  They're all things I\ntell people.  If I wrote a new essay with the same outline as this\nthat wasn't summarizing the founders' responses, everyone would say\nI'd run out of ideas and was just repeating myself.", "What is going on here?", "When I look at the responses, the common theme is that\nstarting a startup was like I said, but way more so.  People just\ndon't seem to get how different it is till they do it.  Why?  The\nkey to that mystery is to ask, how different ", "  Once you\nphrase it that way, the answer is obvious: from a job.  Everyone's\nmodel of work is a job.  It's completely pervasive.  Even if you've\nnever had a job, your parents probably did, along with practically\nevery other adult you've met.", "Unconsciously, everyone expects a startup to be like a job, and\nthat explains most of the surprises.  It explains why people are\nsurprised how carefully you have to choose cofounders and how hard\nyou have to work to maintain your relationship.  You don't have to\ndo that with coworkers.  It explains why the ups and downs are\nsurprisingly extreme.  In a job there is much more damping.  But\nit also explains why the good times are surprisingly good: most\npeople can't imagine such freedom.  As you go down the list, almost\nall the surprises are surprising in how much a startup differs from\na job.", "You probably can't overcome anything so pervasive as the model of\nwork you grew up with.  So the best solution is to be consciously\naware of that.  As you go into a startup, you'll be thinking \"everyone\nsays it's really extreme.\"  Your next thought will probably be \"but\nI can't believe it will be that bad.\"  If you want to avoid being\nsurprised, the next thought after that should be: \"and the reason\nI can't believe it will be that bad is that my model of work is a\njob.\"", "\n", "[", "1", "]\nGraduate students might understand it.  In grad school you\nalways feel you should be working on your thesis.  It doesn't end\nevery semester like classes do.", "[", "2", "]\nThe best way for a startup to engage with slow-moving\norganizations is to fork off separate processes to deal with them.\nIt's when they're on the critical path that they kill you—when\nyou depend on closing a deal to move forward.  It's worth taking\nextreme measures to avoid that.", "[", "3", "]\nThis is a variant of Reid Hoffman's principle that if you\naren't embarrassed by what you launch with, you waited too long to\nlaunch.", "[", "4", "]\nThe question to ask about what you've built is not whether it's\ngood, but whether it's good enough to supply the activation energy\nrequired.", "[", "5", "]\nSome VCs seem to understand technology because they actually\ndo, but that's overkill; the defining test is whether you can talk\nabout it well enough to convince limited partners.", "[", "6", "]\nThis is the same phenomenon you see with defense contractors\nor fashion brands.  The dumber the customers, the more effort you\nexpend on the process of selling things to them rather than making\nthe things you sell.", " to Jessica Livingston for reading drafts of this,\nand to all the founders who responded to my email."]},
{"Title": ["Apple's Mistake"], "Content": ["\n", "  Get funded by\n", ".\n", "\n", "[", "1", "]", "[", "2", "]", "[", "3", "]", "[", "4", "]", "1", "2", "3", "4"]},
{"Title": ["Organic Startup Ideas"], "Content": ["\n", "  Get funded by\n", ".\n", "\n", "[", "1", "]", "[", "2", "]", "[", "3", "]", "1", "2", "3"]},
{"Title": ["RSS"], "Content": ["Aaron Swartz created a scraped\n", "\nof the essays page."]},
{"Title": ["Programming Bottom-Up"], "Content": ["1993\n", "\nIt's worth emphasizing that bottom-up design doesn't mean\njust writing the same program in a different order.  When you\nwork bottom-up, you usually end up with a different program.\nInstead of a single, monolithic program,\nyou will get a larger language with more abstract operators,   \nand a smaller program written in it.  Instead of a lintel,\nyou'll get an arch.\n", "\n", "\n[1] \"But no one can read\nthe program without understanding all your new utilities.\"\nTo see why such statements are usually mistaken,\nsee Section 4.8."]},
{"Title": ["Lisp for Web-Based Applications"], "Content": []}
]