[
{"Title": ["General and Surprising"], "Content": ["September 2017", "The most valuable insights are both general and surprising.\nF = ma for example. But general and surprising is a hard\ncombination to achieve. That territory tends to be picked\nclean, precisely because those insights are so valuable.", "Ordinarily, the best that people can do is one without the\nother: either surprising without being general (e.g.\ngossip), or general without being surprising (e.g.\nplatitudes).", "Where things get interesting is the moderately valuable\ninsights.  You get those from small additions of whichever\nquality was missing.  The more common case is a small\naddition of generality: a piece of gossip that's more than\njust gossip, because it teaches something interesting about\nthe world. But another less common approach is to focus on\nthe most general ideas and see if you can find something new\nto say about them. Because these start out so general, you\nonly need a small delta of novelty to produce a useful\ninsight.", "A small delta of novelty is all you'll be able to get most\nof the time. Which means if you take this route your ideas\nwill seem a lot like ones that already exist. Sometimes\nyou'll find you've merely rediscovered an idea that did\nalready exist.  But don't be discouraged.  Remember the huge\nmultiplier that kicks in when you do manage to think of\nsomething even a little new.", "Corollary: the more general the ideas you're talking about,\nthe less you should worry about repeating yourself.  If you\nwrite enough, it's inevitable you will.  Your brain is much\nthe same from year to year and so are the stimuli that hit\nit. I feel slightly bad when I find I've said something\nclose to what I've said before, as if I were plagiarizing\nmyself. But rationally one shouldn't.  You won't say\nsomething exactly the same way the second time, and that\nvariation increases the chance you'll get that tiny but\ncritical delta of novelty.", "And of course, ideas beget ideas.  (That sounds familiar.)\nAn idea with a small amount of novelty could lead to one\nwith more. But only if you keep going. So it's doubly\nimportant not to let yourself be discouraged by people who\nsay there's not much new about something you've discovered.\n\"Not much new\" is a real achievement when you're talking\nabout the most general ideas. Maybe if you keep going,\nyou'll discover more.", "It's not true that there's nothing new under the sun.  There\nare some domains where there's almost nothing new.  But\nthere's a big difference between nothing and almost nothing,\nwhen it's multiplied by the area under the sun.", "\n", " to Sam Altman, Patrick Collison, and Jessica\nLivingston for reading drafts of this."]},
{"Title": ["Five Founders"], "Content": ["April 2009", " recently asked me who I thought were the 5 most\ninteresting startup founders of the last 30 years.  How do\nyou decide who's the most interesting?  The best test seemed\nto be influence: who are the 5\nwho've influenced me most?  Who do I use as examples when I'm\ntalking to companies we fund?  Who do I find myself quoting?", "I'd guess Steve is the most influential founder not just for me but\nfor most people you could ask.  A lot of startup culture is Apple\nculture.  He was the original young founder.  And while the concept\nof \"insanely great\" already existed in the arts, it was a novel\nidea to introduce into a company in the 1980s.", "More remarkable still, he's stayed interesting for 30 years.  People\nawait new Apple products the way they'd await new books by a popular\nnovelist.  Steve may not literally design them, but they wouldn't\nhappen if he weren't CEO.", "Steve is clever and driven, but so are a lot of people in the Valley.\nWhat makes him unique is his \n", ".  Before him, most\ncompanies treated design as a frivolous extra.  Apple's competitors\nnow know better.", "TJ Rodgers isn't as famous as Steve Jobs, but he may be the best\nwriter among Silicon Valley CEOs.  I've probably learned more from\nhim about the startup way of thinking than from anyone else.  Not\nso much from specific things he's written as by reconstructing the\nmind that produced them: brutally candid; aggressively garbage-collecting\noutdated ideas; and yet driven by pragmatism rather than ideology.", "The first essay of his that I read was so electrifying that I\nremember exactly where I was at the time.  It was \n", " and\nI was downstairs in the Harvard Square T Station.  It felt as if\nsomeone had flipped on a light switch inside my head.", "I'm sorry to treat Larry and Sergey as one person.  I've always\nthought that was unfair to them.  But it does seem as if Google was a\ncollaboration.", "Before Google, companies in Silicon Valley already knew it was\nimportant to have the best hackers.  So they claimed, at least.\nBut Google pushed this idea further than anyone had before.  Their\nhypothesis seems to have been that, in the initial stages at least,\n", " you need is good hackers: if you hire all the smartest people\nand put them to work on a problem where their success can be measured,\nyou win.  All the other stuff—which includes all the stuff that\nbusiness schools think business consists of—you can figure out\nalong the way.  The results won't be perfect, but they'll be optimal.\nIf this was their hypothesis, it's now been verified experimentally.", "Few know this, but one person, Paul Buchheit, is responsible for\nthree of the best things Google has done.  He was the original\nauthor of GMail, which is the most impressive thing Google has after\nsearch.  He also wrote the first prototype of AdSense, and was the\nauthor of Google's mantra \"Don't be evil.\"", "PB made a point in a talk once that I now mention to every startup\nwe fund: that it's better, initially, to make a small number of\nusers really love you than a large number kind of like you.   If I\ncould tell startups only \n", ", \nthis would be one of them.", "Now he's cofounder of a startup called Friendfeed.  It's only a\nyear old, but already everyone in the Valley is watching them.\nSomeone responsible for three of the biggest ideas at Google is\ngoing to come up with more.", "I was told I shouldn't mention founders of YC-funded companies in\nthis list.   But Sam Altman can't be stopped by such flimsy rules.\nIf he wants to be on this list, he's going to be.", "Honestly, Sam is, along with Steve Jobs, the founder I refer to\nmost when I'm advising startups.  On questions of design, I ask\n\"What would Steve do?\" but on questions of strategy or ambition I\nask \"What would Sama do?\"", "What I learned from meeting Sama is that the doctrine of the elect\napplies to startups.  It applies way less than most people think:\nstartup investing does not consist of trying to pick winners the\nway you might in a horse race.  But there are a few people with\nsuch force of will that they're going to get whatever they want."]}